<?php
// Инкремент и декремент

// Префиксный инкремент
$a =5;
echo "++\$a должно быть 6:" . ++$a . "<br>";
echo "\$a должно быть 6:" . $a . "<br>";

// Постфиксный инкремент
$b =5;
echo "\$b++ должно быть 5:" . $b++ . "<br>";
echo "\$b должно быть 6:" . $b . "<br>";

// Префиксный декремент
$c =5;
echo "--\$с должно быть 4:" . --$c . "<br>";
echo "\$с должно быть 4:" . $c . "<br>";

// Постфиксный декремент
$d =5;
echo "\$d-- должно быть 5:" . $d-- . "<br>";
echo "\$d должно быть 4:" . $d . "<br>";