<?php
//арифметические оператиоры

//сложение
$sum = 5 + 5;
echo "Сложение 5 + 5 = " . $sum;
echo "<br>";

//вычитание
$sub = 7 -2;
echo "Вычитание 7 - 2 = " . $sub;
echo "<br>";

//умножение
$mult = 3 * 9;
echo "Умножение 3 * 9 = " . $mult;
echo "<br>";

//Деление
$div = 21 / 3;
echo "Деление 21 / 3 = " . $div;
echo "<br>";

//Остаток от деления
$modulo = 13 % 3;
echo "Остаток от деления 13 % 3 = " . $modulo;
echo "<br>";

//Возведение в степень
$step = 3 ** 2;
echo "Возведение в степень 3 ** 2 = " . $step;
echo "<br>";
